In [2]:
import pandas as pd
import matplotlib as plt
actor_data = pd.read_csv('actor.csv', index_col = 0)
actor_data.head()

         first_name     last_name          last_update
actor_id
1          PENELOPE       GUINESS  2006-02-15 04:34:33
2              NICK      WAHLBERG  2006-02-15 04:34:33
3                ED         CHASE  2006-02-15 04:34:33
4          JENNIFER         DAVIS  2006-02-15 04:34:33
5            JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [3]:
actor_data.describe()

       first_name last_name          last_update
count         200       200                  200
unique        128       121                    1
top      PENELOPE    KILMER  2006-02-15 04:34:33
freq            4         5                  200

There are duplicates, however we can not certify it. Let's  merge the first_name and last_name field in order to check whether there are duplicate or it is combination of different name.

In [9]:
actor_data['full_name'] = actor_data['first_name'] +' '+ actor_data['last_name']
actor_data.head()

         first_name     last_name          last_update            full_name
actor_id
1          PENELOPE       GUINESS  2006-02-15 04:34:33     PENELOPE GUINESS
2              NICK      WAHLBERG  2006-02-15 04:34:33        NICK WAHLBERG
3                ED         CHASE  2006-02-15 04:34:33             ED CHASE
4          JENNIFER         DAVIS  2006-02-15 04:34:33       JENNIFER DAVIS
5            JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA

In [10]:
actor_data.describe()

       first_name last_name          last_update    full_name
count         200       200                  200          200
unique        128       121                    1          199
top      PENELOPE    KILMER  2006-02-15 04:34:33  SUSAN DAVIS
freq            4         5                  200            2

The summary of the table show that there is duplicate entering for the actor named <strong>SUSAN DAVIS</strong>

In [ ]:
# Let's select the rows with SUSAN DAVIS and look closely into the duplicate value